Repository: msdx/gradle-translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: You can combine multiple plugins in a single project, so you can use the War and Groovy plugins together to build a Groovy based web application.
zh_cn: 你可以在单个project中组合多个插件，因此你可以一起使用War和Groovy插件来构建一个基于Groovy的web应用程序。

source: You can configure arbitrary objects in the following very readable way.
zh_cn: 您可以用以下非常易理解的方式配置任意对象。

source: You can configure the current project using an external build script.
zh_cn: 您可以使用外部构建脚本来配置当前项目。

source: You can control which tool chain will be used to build by changing the operating system PATH to include the desired tool chain compiler.
zh_cn: 你可以通过更改操作系统的PATH让其包含所需的工具链编译器，来控制使用哪个工具链。

source: You can create a separate project for your task class.
zh_cn: 你可以为你的任务类创建一个独立的项目。

source: You can create stand alone instances of a Manifest.
zh_cn: 您可以创建一个单独的Manifest实例。

source: You can customize these properties:
zh_cn: 你可以自定义这些属性：

source: You can declare a dependency on the API of the current version of Gradle by using the DependencyHandler.gradleApi() method.
zh_cn: 你可以通过使用DependencyHandler.gradleApi()方法，来声明一个当前的 Gradle 版本的 API 上的依赖。

source: You can declare a dependency on the Groovy that is distributed with Gradle by using the DependencyHandler.localGroovy() method.
zh_cn: 可以通过使用DependencyHandler.localGroovy()方法，来声明对与 Gradle 一起发布的 Groovy 的依赖。

source: You can declare which tasks produce the files for a file dependency.
zh_cn: 你可以声明哪些任务将产生作为文件依赖的文件。

source: You can disable the HTML test report using the Test.setTestReport() method.
zh_cn: 您可以使用Test.setTestReport()方法来禁用 HTML 测试报告。

source: You can do this by using the method hasProperty('propertyName') which returns true or false.
zh_cn: 你可以通过使用方法hasProperty('propertyName') 来进行检查，它返回true或false。

source: You can do this with Gradle, but we don't recommend it.
zh_cn: 你可以使用 Gradle 来做，但我们不推荐它。

source: You can easily depend on these constantly changing dependencies by using a dynamic version.
zh_cn: 你可以通过使用动态版本很容易地依赖这些不断变化的依赖。

source: You can easily write a manifest to disk.
zh_cn: 你可以很轻松地把一个manifest写入磁盘中。

source: You can even apply other scripts from the external script.
zh_cn: 您甚至可以在外部脚本中应用其他脚本。

source: You can exclude a transitive dependency either by configuration or by dependency:
zh_cn: 通过配置或者是通过依赖，你可以排除一个传递依赖：

source: You can execute the checks by running gradle check.
zh_cn: 你可以通过运行gradle check执行检查。

source: You can filter the contents of file, rename files, and all the other things you can do with a copy spec.
zh_cn: 您可以通过一个复制规范来筛选文件的内容、 重命名文件和进行其他你可以做的事情。

source: You can find a list of external plugins on the wiki.
zh_cn: 你可以在维基上找到外部插件的列表。

source: You can find more details in the API documentation for SourceSet.
zh_cn: 你可以在SourceSet的 API 文档中查看更多的详细信息。

source: You can find more sample Java projects in the samples/webApplication directory in the Gradle distribution.
zh_cn: 你可以在Gradle的 samples/webApplication 目录中找到更多的Java 的示例项目。

source: You can find out more about closures here.
zh_cn: 你可以在这里查看更多有关闭包的资料。

source: You can find out more about the Groovy plugin in Chapter 24, The Groovy Plugin, and you can find more sample Groovy projects in the samples/groovy directory in the Gradle distribution.
zh_cn: 你可以在 第24章 Groovy插件中了解更多关于Groovy 插件的内容，或在Gradle的 samples/groovy目录中找到更多的Groovy project的例子。

source: You can find out more about the War plugin in Chapter 26, The War Plugin and the Jetty plugin in Chapter 28, The Jetty Plugin.
zh_cn: 你可以在 第26章， War插件 和在第28章 Jetty插件.中了解到更多有关War插件和Jetty插件的内容。

source: You can find out more about the copy task in Section 16.6, “Copying files”.
zh_cn: 你可以在16.6章节，“复制文件”中找到关于copy任务的更多信息。

source: You can find out more about the listener interfaces in Section 55.6, “Responding to the lifecycle in the build script”.
zh_cn: 你可以在 55.6章节，“在构建脚本中响应生命周期”参阅更多有关监听器接口的信息。

source: You can fine-tune certain aspects of caching using the ResolutionStrategy for a configuration.
zh_cn: 你可以在一个配置中通过使用ResolutionStrategy对缓存的某些方面进行微调。

source: You can fully customize the merge behavior by adding eachEntry actions in which you have access to a ManifestMergeDetails instance for each entry of the resulting manifest.
zh_cn: 你可以通过添加eachEntry action 来完全自定义合并行为，它可以让你对每一项生成的manifest 访问它的一个ManifestMergeDetails实例。

source: You can further customize the archive names:
zh_cn: 您可以进一步自定义存档名称：

source: You can generate dependency reports from the command line (see Section 11.6.4, “Listing project dependencies”).
zh_cn: 你可以从命令行生成依赖报告 （参阅 第11.6.4节，“列出项目依赖”）。

source: You can get the property directly from the AntBuilder instance.
zh_cn: 你可以直接从AntBuilder实例获得属性。

source: You can implement a custom task class in pretty much any language you like, provided it ends up compiled to bytecode.
zh_cn: 你可以使用你喜欢的几乎任何一种语言来实现一个自定义任务类，只要它最终能够提供编译的字节码。

source: You can include the task class directly in the build script.
zh_cn: 你可以在构建脚本中直接包含这个任务类。

source: You can influence the location of build dashboard plugin generation via ReportingExtension.
zh_cn: 你可以通过 ReportingExtension 修改 build dashboard 插件生成内容的位置。

source: You can launch the application in debug mode with gradle run --debug-jvm (see JavaExec.setDebug()).
zh_cn: 你可以通过gradle run --debug-jvm 在调试模式下启动该应用程序(见JavaExec.setDebug())。

source: You can learn more about how to work with archives in Section 16.8, “Creating archives” and artifact configurations in Chapter 51, Publishing artifacts.
zh_cn: 你可以在第16.8节，“创建档案”和第51章， 发布artifact中了解如何使用archives和配置artifact。

source: You can locate a file relative to the project directory using the Project.file() method.
zh_cn: 你可以使用Project.file()方法来找到一个相对于项目目录的文件 。

source: You can map a configuration to one and only one scope.
zh_cn: 你可以把一个configuration映射到一个并且只能是一个scope上。

source: You can merge other manifests into any Manifest object.
zh_cn: 你可以把其他的manifest 合并到任何一个Manifest对象中。

source: You can modify these descriptors in the settings file at any time.
zh_cn: 你可以在任何时间修改设置文件中的这些描述符。

source: You can optionally specify that only a subset of dependencies from the original configuration should be copied.
zh_cn: 你可以选择指定只复制原始配置里的一个子集的依赖。

source: You can override the default cache modes using command line options.
zh_cn: 你可以使用命令行选项重写默认的缓存模式。

source: You can pass any object to the file() method, and it will attempt to convert the value to an absolute File object.
zh_cn: 您可以把任何对象传递给file()方法，而它将尝试将其转换为一个绝对路径的File对象。

source: You can pass this method any number of objects, which are then converted into a set of File objects.
zh_cn: 你可以向这个方法传入任意个对象，而它们会被转换为一组 File 对象。

source: You can place a gradle.properties file in the Gradle user home directory (defaults to USER_HOME/.gradle) or in your project directory.
zh_cn: 您可以把一个gradle.properties文件放在 Gradle 的用户主目录 （默认为USER_HOME/.gradle） ，或您的项目目录中。

source: You can put the source for the task class in the rootProjectDir/buildSrc/src/main/groovy directory.
zh_cn: 你可以把任务类的源码放在 rootProjectDir/buildSrc/src/main/groovy 目录中。

source: You can read about the new publishing plugins in Chapter 64, Ivy Publishing (new) and Chapter 65, Maven Publishing (new).
zh_cn: 你可以在 64 章，Ivy 发布（新）和 65 章， Maven 发布（新）中读到有关新发布插件的内容。

source: You can receive a notification immediately after a task is added to a project.
zh_cn: 你可以在有任务添加到项目后立即收到通知。

source: You can receive a notification immediately after the task execution graph has been populated.
zh_cn: 在任务执行图生成之后你可以立刻收到一个通知。

source: You can receive a notification immediately before and after a project is evaluated.
zh_cn: 你可以在一个项目评估之前及之后立刻收到通知。

source: You can receive a notification immediately before and after any task is executed.
zh_cn: 在任一任务执行前你都会马上收到一条通知。

source: You can reorder favorites to your liking and even export them to disk so they can imported by others.
zh_cn: 你可以根据自己的喜好，对收藏夹进行排序，甚至可以把它们导出到磁盘，并在其他地方导入。

source: You can replace much of Gradle's logging UI with your own.
zh_cn: 您可以用您自己的 logging UI大量地替换 Gradle 的。

source: You can run "gradle distZip" to package the main distribution as a ZIP, or "gradle distTar" to create a GZip compressed TAR file.
zh_cn: 你可以运行“gradle distZip”把 main distribution 打包为 ZIP，或者是运行“gradle distTar”来创建一个使用 GZip 压缩的 TAR 文件。

source: You can run "gradle installDist" to assembles the distribution content, uncompressed, into "$buildDir/install/main".
zh_cn: 你可以运行“gradle installDist”来组装这些分发内容，解压到“$buildDir/install/main”。

source: You can run gradle distZip to create a ZIP containing the distribution.
zh_cn: 你可以运行 gradle distZip 把 distrubution 打包成一个 ZIP 文件。

source: You can run gradle installApp to create an image of the application in build/install/projectName.
zh_cn: 您可以运行gradle installApp，在 build/install/projectName 中创建一张应用程序的图像。

source: You can select the files to copy using Ant-style include or exclude patterns, or using a closure:
zh_cn: 您可以使用 Ant 风格的包含或排除模式，或使用一个闭包，来选择要复制的文件：

source: You can set custom includes / excludes, only those classes will be scanned.
zh_cn: 您可以设置自定义的includes 或 excludes，这样就只有这些类才会被扫描。

source: You can set the property directly on the AntBuilder instance.
zh_cn: 你可以直接在AntBuilder实例上设置属性。

source: You can set the value of this property using any of the types supported by the files() method, which was shown above.
zh_cn: 你可以使用上面所示的files()方法所支持的任意类型的对象设置此属性。

source: You can specify that test processes should be restarted after it has executed a certain number of test classes.
zh_cn: 你可以指定在执行了一定数量的测试类之后，重启那个测试进程。

source: You can specify whether or not to execute your tests in parallel.
zh_cn: 你可以指定是否要并行运行你的测试。

source: You can then refer to the custom Ant task as you would a built-in Ant task.
zh_cn: 然后，您可以像引用内置的 Ant 任务一样引用自定义 Ant 任务。

source: You can then use the targets of your Ant build as if they were Gradle tasks.
zh_cn: 然后你可以使用你的 Ant 构建中的target，就好像它们是 Gradle 任务一样。

source: You can toggle the filter via the Filter button.
zh_cn: 你可以通过过滤器（Filter）按钮切换是否进行过滤。

source: You can use Gradle's Ant integration as a path for migrating your build from Ant to Gradle.
zh_cn: 你可以把 Gradle 的 Ant 集成当成一个路径，将你的构建从 Ant 迁移至 Gradle 。

source: You can use Gradle's dependency management to assemble the classpath to use for the custom tasks.
zh_cn: 你可以使用 Gradle 的依赖管理组合类路径，以用于自定义任务。

source: You can use an archive task to define an artifact:
zh_cn: 你可以使用一个archive任务来定义构件：

source: You can use either client module dependencies to express the dependency relations, or artifact dependencies in case a first level dependency has no transitive dependencies.
zh_cn: 您可以使用客户端模块依赖，或者是工件依赖来表达依赖关系，后者的情况中第一级依赖是没有传递依赖的。

source: You can use individual Ant tasks or entire Ant builds in your Gradle builds.
zh_cn: 您可以在你的 Gradle 构建中，使用单独的 Ant 任务或整个 Ant 构建。

source: You can use that for example, to share manifest information between jars.
zh_cn: 它可以用于共享两个jar包的manifest 信息。

source: You can use the Copy task to copy files.
zh_cn: 你可以使用Copy任务来复制文件。

source: You can use the Project.copySpec() method to share content between archives.
zh_cn: 你可以使用Project.copySpec()方法在归档之间共享内容。

source: You can use the ant.importBuild() method to import an Ant build into your Gradle project.
zh_cn: 你可以使用ant.importBuild()方法来向 Gradle 项目导入一个 Ant 构建。

source: You can use the onlyIf() method to attach a predicate to a task.
zh_cn: 你可以使用onlyIf()方法将断言附加到一项任务中。

source: You can use the archive tasks without using the Java plugin, if you like.
zh_cn: 如果你愿意，使用归档任务时可以不需要Java插件。

source: You can use the command line argument (Appendix D, Gradle Command Line) or configure your build environment (Section 20.1, “Configuring the build environment via gradle.properties”).
zh_cn: 你可以使用命令行参数（附录 D， Gradle 命令行），或者是配置你的构建环境（第 20.1 节，“通过 gradle.properties 配置构建环境”）。

source: You can use the command line switches shown in Table 18.2, “Log level command-line options” to choose different log levels.
zh_cn: 您可以使用表 18.2，“日志级别的命令行选项”中所示的命令行开关来选择不同的日志级别。

source: You can use the configuration to access the declared dependencies or a subset of those:
zh_cn: 你可以使用配置来访问它们的声明依赖或其中一个子集：

source: You can use the contents of an archive, such as a ZIP or TAR file, as a file tree.
zh_cn: 您可以使用档案的内容，如 ZIP 或者 TAR 文件，作为一个文件树。

source: You can use these configurations to define the compile and runtime dependencies of the source set.
zh_cn: 你可以使用这些配置来定义源集的编译和运行时的依赖。

source: You can use these properties in your build script as though they were properties of the project object (see Section 21.3, “Conventions”).
zh_cn: 您可以在构建脚本中使用这些属性，就像它们是project对象的属性一样（见第21.3节，“约定”）。

source: You can use these properties in your build script as though they were properties of the source set object (see Section 21.3, “Conventions”).
zh_cn: 你可以在你的构建脚本中，把这些属性当成是source set 对象中的属性一样使用 （见第 21.3，“公约”）。

source: You can use this logger the same way as you use the provided logger in the build script.
zh_cn: 你可以在构建脚本中，以与内置的logger 相同的方式来使用这个logger。

source: You can, for example, change the name of the archive:
zh_cn: 你可以，比方说，更改归档文件的名称：

source: You can, however, set a different language for each project in a multi-project build.
zh_cn: 不过，在多项目构建中你可以为不同的项目设置不同的语言。

source: You configure the project layout by configuring the appropriate source set.
zh_cn: 你可以通过配置适当的源集，来配置项目的布局。

source: You could also do an iteration via allprojects.each, but that would be more verbose.
zh_cn: 你也可以通过allprojects.each来进行迭代，不过这样写会比较冗长。

source: You could also have a mixed strategy.
zh_cn: 你也可以使用混合策略。

source: You could even use Gradle simply as a powerful Ant task scripting tool.
zh_cn: 你甚至可以只把 Gradle 当作一个强大的 Ant 任务脚本的工具。

source: You could, for instance, call doFirst() or doLast() with a closure in the task constructor to add behaviour.
zh_cn: 你能够，例如，在构建方法中调用 doFirst() 或者 doLast() 并传入一个闭包来添加行为。

source: You do all this using a copy spec.
zh_cn: 你可以使用一个复制规范来做这些。

source: You do this by adding a dependency to the groovy configuration.
zh_cn: 你可以通过在groovy配置中添加依赖来完成。

source: You do this using the Project.zipTree() and Project.tarTree() methods.
zh_cn: 你可以通过使用Project.zipTree()或Project.tarTree()方法来实现这一过程。

source: You don't have to use a method to define the behaviour for the task.
zh_cn: 你不需要使用一个方法来定义这个任务的行为。

source: You don't want to expose people who want to build your project, to the downtimes or sometimes very long response times of Maven Central.
zh_cn: 你不想曝光给想要对你的项目进行构建的人，Maven 中央仓停机或者有时候响应时间太长。

source: You execute an Ant task by calling a method on the AntBuilder instance.
zh_cn: 通过调用 AntBuilder实例上的一个方法，可以执行一个 Ant 任务。

source: You have also learned how to add additional behavior to these tasks later on.
zh_cn: 之后您还学习了如何将其他行为添加到这些任务中。

source: You have been making changes, but have not built the entire project since performing a clean.
zh_cn: 你做了一些修改，但从执行clean以来还没有构建整个项目。

source: You have to declare the projects taking part in the multiproject build in the settings file.
zh_cn: 你需要在settings文件中，声明要加入多项目构建的项目。

source: You have to explicitly do this assignment.
zh_cn: 你必须进行显示的指定。

source: You have to repeat the context (myCopy) in the configuration statement every time.
zh_cn: 您必须在每一次的配置语句重复上下文 （myCopy）。

source: You implement the predicate as a closure.
zh_cn: 你可以用一个闭包来实现断言。

source: You may also specify how to transform the files as they are copied.
zh_cn: 您还可以在复制文件的时候指定如何转换文件。

source: You may configure any number of repositories, each of which is treated independently by Gradle.
zh_cn: 您可以配置任意数量的仓库，每一个都会被Gradle 独立处理。

source: You may want to start the daemon in --foreground mode to observe how the build is executed.
zh_cn: 你可能想要以--foreground模式启动守护程序，以观察构建是怎么执行的。

source: You may wish to use the new Sonar Runner Plugin instead of this plugin.
zh_cn: 你可能会想使用新的Sonar Runner 插件来代替现在这个插件。

source: You might also want to learn where conflicting versions are used and consolidate on a particular version of a dependency across your organization.
zh_cn: 你也可能想要了解版本冲突用到的地方，并且在你的整个组织中统一一个指定版本的依赖。

source: You might be wondering why we have implemented a feature we obviously don't like that much.
zh_cn: 你可能想知道，为什么我们要实现一个我们显然不喜欢做的功能。

source: You might do this when, for example, the files are generated by the build.
zh_cn: 例如，你可以在通过构建生成文件的时候这样做。

source: You might do this, for example, if you want to customize the UI in some way - to log more or less information, or to change the formatting.
zh_cn: 你可以这样，比如，如果您想要以某种方式自定义 UI ——以输出更多或更少的信息，或修改日志格式，

source: You might have different group of artifacts which have a different set of dependencies.
zh_cn: 你可以有不同组的构件，它们有不同的依赖。

source: You might need dependencies that are not uploaded to Maven Central yet.
zh_cn: 你可能需要还没有上传到Maven 中央仓的依赖。

source: You might need it for example, to add libraries to your build script classpath (see Chapter 59, Organizing Build Logic).
zh_cn: 你可能需要一个关于将libraries添加到你的构建脚本类路径中的例子（见第59章，组织构建逻辑）。

source: You might refer to their API documentation to learn more about them.
zh_cn: 您可能会引用他们的 API 文档，以了解更多关于它们的信息。

source: You need to declare a filter for each artifact you want to publish.
zh_cn: 你需要为你想发布的每一个构件声明一个过滤器。

source: You need to make sure the task dependencies are declared correctly to avoid ordering issues.
zh_cn: 你需要确保正确地声明任务，以避免排序的问题。

source: You need to provide the signing plugin with your key information, which means three things:
zh_cn: 您需要向签名插件提供你的关键信息，即如下三项信息：

source: You often need to locate the tasks that you have defined in the build file, for example, to configure them or use them for dependencies.
zh_cn: 你经常需要在构建文件中查找你所定义的任务，例如，为了去配置或是依赖它们。

source: You only need to specify the leaves of the tree.
zh_cn: 你只需要指定树上的叶子。

source: You pass nested elements to an Ant task inside a closure.
zh_cn: 你可以在一个闭包里把嵌套的元素传给一个 Ant 任务。

source: You pass nested text to an Ant task by passing it as a parameter of the task method call.
zh_cn: 你可以把一个嵌套文本，通过作为任务方法调用的参数，把它传给一个 Ant 任务。

source: You probably want to set-up a repository proxy for this.
zh_cn: 你可能需要设置一个仓库代理。

source: You replace the logging using the Gradle.useLogger() method.
zh_cn: 您可以使用 Gradle.useLogger() 方法替换这个logging。

source: You should note that the TestReport type combines the results from multiple test tasks and needs to aggregate the results of individual test classes.
zh_cn: 你应该注意到，TestReport类型组合了多个测试任务的结果，并且需要聚合各个测试类的结果。

source: You should now be able to browse the analysis results.
zh_cn: 你现在应该能够看到分析结果了。

source: You simply declare the task and configure the task using its properties.
zh_cn: 你只需要简单地声明这个任务，并用它的属性来配置它。

source: You specify the source files using the CopySpec.from() method.
zh_cn: 你可以使用CopySpec.from()方法指定源文件，

source: You use a file tree in the same way you use a file collection.
zh_cn: 你可以像使用一个文件集合的方式一样来使用一个文件树。

source: You use the task name as the method name.
zh_cn: 你可以把任务名称当作方法名称使用。

source: You use this kind of dependency when you are developing custom Gradle plugins and task types.
zh_cn: 当你正在开发自定义的 Gradle 插件和任务类型时，你可以使用这种类型的依赖。

source: You use this kind of dependency when you want to override the meta-data for the module.
zh_cn: 当你想要重写模块的元数据时，你可以使用这种类型的依赖。

source: You use this to declare the ANTLR dependency that you wish to use.
zh_cn: 你可以使用它来声明你想要使用的 ANTLR 依赖。

source: You want to build any necessary supporting jars, but only perform code quality and unit tests on the project you have changed.
zh_cn: 你想要构建出所有必需的支持jar包，但只对这个你修改了的项目进行代码质量和单元测试。

source: You want to deal properly with wrong metadata in a Maven Central POM file.
zh_cn: 你想要正确地处理 Maven 中央仓 POM 文件中错误的元数据。

source: You will find more on this topic in Section 56.6, “Dependencies - Which dependencies?”
zh_cn: 在 第 56.6 节， “依赖——哪些依赖”，你可以看到更多关于这个主题的内容。

source: You will need to provide values for some additional properties.
zh_cn: 您需要提供一些值给附加的属性。

source: You would use 'should run after' rule when ordering preference for faster feedback, where the ordering is helpful but not strictly required.
zh_cn: 当倾向于更快的反馈时，会使用“应该在之后运行”的规则，因为这种排序很有帮助但要求不严格。

source: Your webapp directory may of course contain a WEB-INF sub-directory, which again may contain a web.xml file.
zh_cn: 你的webapp目录自然可能包含一个WEB-INF子目录，这个子目录可能还再包含一个web.xml文件。

source: Your build script can receive notifications as the build progresses through its lifecycle.
zh_cn: 在构建通过其生命周期的时候，你的构建脚本会接收到对应的通知。

source: Your build script may contain statements like:"ant clean compile".execute().
zh_cn: 你的构建脚本可能包含有类似这样的语句："ant clean compile".execute()。

source: Your build script needs properties which values should not be seen by others.
zh_cn: 而你的构建脚本需要一些不能让其他人知道的属性值，

source: Your build scripts configure this dependency graph.
zh_cn: 你的构建脚本能配置这个依赖关系图。

source: Your compiled classes are compiled to WEB-INF/classes.
zh_cn: 已编译的类被编译进WEB-INF/classes。

source: Your compiled classes, and their runtime dependencies are also included in the WAR file.
zh_cn: 已编译的类文件和他们的运行时依赖也会被包含在WAR文件中。

source: Your logger can implement any of the listener interfaces listed below.
zh_cn: 你的logger可以实现下面列出的任何监听器接口。

source: Your project can contain Groovy source code, Java source code, or a mix of the two.
zh_cn: 你的项目可以包含Groovy源码，Java源码，或者两者都包含。

source: ZIPs and TARs are generated into project.buildDir/distributions.
zh_cn: ZIP文件和 TAR文件会生成到 project.buildDir/distributions中。

source: a multiproject build, if the settings.gradle file does define a multiproject hierarchy.
zh_cn: 多项目构建，如果settings.gradle文件定义了一个多项目的层次结构。

source: a single project build, if the settings.gradle file does not define a multiproject hierarchy
zh_cn: 单项目构建，如果settings.gradle文件没有定义一个多项目的层次结构

source: adds build ConfigurationName tasks.
zh_cn: 添加构建 ConfigurationName任务。

source: adds upload ConfigurationName tasks.
zh_cn: 添加上传ConfigurationName任务。

source: an empty manifest
zh_cn: 一个空的清单

source: ant.html#N113E8
zh_cn: ant.html

source: ant.html#N11488
zh_cn: ant.html

source: ant.html#N114E2
zh_cn: ant.html

source: ant.html#N11536
zh_cn: ant.html

source: configures reasonable default values for all archive tasks (e.g. tasks that inherit from AbstractArchiveTask).
zh_cn: 为所有归档任务配置合适的默认值（比如从AbstractArchiveTask继承来任务）。

source: from gradle.properties located in gradle user home.
zh_cn: 位于gradle 用户主目录的gradle.properties。

source: from gradle.properties located in project build dir.
zh_cn: 位于项目构建目录的gradle.properties。

source: from system properties, e.g. when -Dsome.property is used in the command line.
zh_cn: 系统属性，例如当在命令行中使用 -Dsome.property 时。

source: groovy_plugin.html#N129FE
zh_cn: groovy_plugin.html#N129EF

source: groovy_plugin.html#N12A93
zh_cn: groovy_plugin.html#N129EF

source: java_plugin.html#N11E80
zh_cn: java_plugin.html

source: java_plugin.html#N11E8F
zh_cn: java_plugin.html

source: java_plugin.html#N11EA7
zh_cn: java_plugin.html

source: java_plugin.html#N12119
zh_cn: java_plugin.html

source: java_plugin.html#N1223E
zh_cn: java_plugin.html

source: lib
zh_cn: into('libs') {

source: local Maven repository)
zh_cn: 本地 Maven 存储库）

source: more_about_tasks.html#N10CF6
zh_cn: more_about_tasks.html#N10CBF

source: more_about_tasks.html#N10E91
zh_cn: more_about_tasks.html#N10CBF

source: more_about_tasks.html#N10EA3
zh_cn: more_about_tasks.html#N10CBF

source: more_about_tasks.html#N10EC0
zh_cn: more_about_tasks.html#N10CBF

source: more_about_tasks.html#N10F94
zh_cn: more_about_tasks.html#N10CBF

source: more_about_tasks.html#N10FC0
zh_cn: more_about_tasks.html#N10CBF

source: native language plugins
zh_cn: 本机语言插件

source: no logging options
zh_cn: 没有日志选项

source: plugins.html#N1185A
zh_cn: plugins.html

source: plugins.html#N118FD
zh_cn: plugins.html

source: project(":project1") {
zh_cn: project

source: project(":project2") {
zh_cn: project

source: props["other.project.property"] = ["foo", "bar", "baz"] }
zh_cn: props["other.global.property"] = ["foo", "bar", "baz"] }

source: see Section 23.5, “Dependency management” for details.
zh_cn: 详细信息请参阅第 23.5 节，“依赖管理” 。

source: sourceSets.main.allSource.srcDirs (filtered to only include existing directories)
zh_cn: sourceSets.main.allSource.srcDirs（过滤为只包含存在的目录）

source: sourceSets.main.runtimeClasspath (filtered to only include directories)
zh_cn: sourceSets.main.runtimeClasspath （过滤为只包含存在的目录）
